source ../../scripts/tool_settings.tcl
#### Route Design
routeDesign
setAnalysisMode -aocv true
optDesign -postRoute -hold -setup
